Revit 2026 API

# RevitAPIEventArgs Methods

---

The RevitAPIEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RevitAPIEventArgs Class

Autodesk.Revit.DB.Events Namespace